tap "bufbuild/buf"
tap "clojure/tools"
tap "homebrew/services"
tap "mongodb/brew"
brew "anyenv"
brew "direnv"
brew "gh"
brew "git-lfs"
brew "golang-migrate"
brew "golangci-lint"
brew "python@3.12"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "jq"
brew "libpq"
brew "openjdk"
brew "liquibase"
brew "node"
brew "mongosh"
brew "pinact"
brew "postgresql@14"
brew "tig"
brew "uv"
brew "bufbuild/buf/buf"
brew "clojure/tools/clojure"
brew "mongodb/brew/mongodb-community"
cask "aws-vault"
cask "meetingbar"
cask "snowflake-snowsql"
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "lokalise.i18n-ally"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "rvest.vs-code-prettier-eslint"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
